snailshall/LVGL_stm32F103_Exe/STM32F103TraSample/STM32 NES simulator/STM32 NES simulator/NES/PPU_DMA.c
#include "nes_main.h"
#include "bsp_ili9341_lcd.h"
#include "misc.h"
#include "stm32f10x_dma.h"


uint8 NameTable[2048];
PPU_RegType PPU_Reg;
PPU_MemType PPU_Mem;
Spr_MemType Spr_Mem;
SpriteType * const sprite = (SpriteType *)&Spr_Mem.spr_ram[0]; //指向第一个sprite 0 的位置

/*显示相关*/
#define SCANLINE_SIZE  (8 + 256 + 8)
uint8   SpriteHitFlag, PPU_Latch_Flag;  //sprite #0 显示碰撞点所在扫描行号，背景位移￥2005写入标志
int     PPU_scanline;                   //当前扫描行
uint16  Buffer_scanline[SCANLINE_SIZE];   //行显示缓存，上下标越界最大为7，显示区7~263 0~7 263~270为防止溢出区
uint8   PPU_BG_VScrlOrg, PPU_BG_HScrlOrg;
//-------------------------------------------------------------------------------

//NES 调色板 颜色表(RGB565) 64
const uint16 NES_Color_Palette[64] =
{
    0x73AE,0x20D1,0x0015,0x4013,0x880E,0xA802,0xA000,0x7840,0x4160,0x0220,0x0280,0x01E2,0x19EB,0x0000,0x0000,0x0000,
    0xBDF7,0x039D,0x21DD,0x801E,0xB817,0xE00B,0xD940,0xCA61,0x8B80,0x04A0,0x0540,0x0487,0x0411,0x0000,0x0000,0x0000,
    0xFFFF,0x3DFF,0x5CBF,0xA45F,0xF3DF,0xFBB6,0xFBAC,0xFCC7,0xF5E7,0x8682,0x4EE9,0x5FD3,0x075B,0x0000,0x0000,0x0000,
    0xFFFF,0xAF3F,0xC6BF,0xD65F,0xFE3F,0xFE3B,0xFDF6,0xFED5,0xFF34,0xE7F4,0xAF97,0xB7F9,0x9FFE,0x0000,0x0000,0x0000
};
//-------------------------------------------------------------------------------

//PPU 初始化
void PPU_Init( uint8* patterntableptr,   /* Pattern table 地址*/
               uint8  ScreenMirrorType ) /* 屏幕镜像类型*/
{
    NVIC_InitTypeDef NVIC_InitStructure;
    DMA_InitTypeDef DMA_InitBlock;
    
    NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

    DMA_InitBlock.DMA_PeripheralBaseAddr = FSMC_Addr_ILI9341_DATA;
    DMA_InitBlock.DMA_MemoryBaseAddr = (uint32_t)(&Buffer_scanline[16]);
    DMA_InitBlock.DMA_DIR = DMA_DIR_PeripheralDST;
    DMA_InitBlock.DMA_BufferSize = (uint32_t)240;
    DMA_InitBlock.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitBlock.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitBlock.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
    DMA_InitBlock.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
    DMA_InitBlock.DMA_Mode = DMA_Mode_Normal;
    DMA_InitBlock.DMA_Priority = DMA_Priority_VeryHigh;
    //DMA_InitBlock.DMA_Priority = DMA_Priority_High;
    DMA_InitBlock.DMA_M2M = DMA_M2M_Enable;
    DMA_Init(DMA1_Channel5, &DMA_InitBlock);

    memset(&PPU_Mem, 0, sizeof(PPU_Mem)); //清零存储器
    memset(&Spr_Mem, 0, sizeof(Spr_Mem));
    memset(&PPU_Reg, 0, sizeof(PPU_Reg));

    PPU_Mem.patterntable0 = patterntableptr;
    PPU_Mem.patterntable1 = patterntableptr + 0x1000;

    if(ScreenMirrorType == 0)   //水平镜像
    {
        PPU_Mem.name_table[0] = &NameTable[0];
        PPU_Mem.name_table[1] = &NameTable[0];
        PPU_Mem.name_table[2] = &NameTable[1024];
        PPU_Mem.name_table[3] = &NameTable[1024];
    }
    else                        //垂直镜像
    {
        PPU_Mem.name_table[0] = &NameTable[0];
        PPU_Mem.name_table[1] = &NameTable[1024];
        PPU_Mem.name_table[2] = &NameTable[0];
        PPU_Mem.name_table[3] = &NameTable[1024];
    }

    SpriteHitFlag   = PPU_Latch_Flag = FALSE;
    PPU_BG_VScrlOrg = 0;
    PPU_BG_HScrlOrg = 0;
    PPU_scanline    = 0;
}
//-------------------------------------------------------------------------------

//PPU 存储器与寄存器函数组
//读PPU name table 数据
uint8 PPU_NameTablesRead(void)
{
    uint16 addrtemp = PPU_Mem.PPU_addrcnt & 0xFFF;
    if(addrtemp > 0xC00)
    {
        return PPU_Mem.name_table[3][addrtemp - 0xC00];        //nametable3
    }
    if(addrtemp > 0x800)
    {
        return PPU_Mem.name_table[2][addrtemp - 0x800];        //nametable2
    }
    if(addrtemp > 0x400)
    {
        return PPU_Mem.name_table[1][addrtemp - 0x400];        //nametable1
    }
    else
    {
        return PPU_Mem.name_table[0][addrtemp];                //nametable0
    }
}
//-------------------------------------------------------------------------------

//写PPU name table 数据
void PPU_NameTablesWrite(uint8 value)
{
    uint16 addrtemp = PPU_Mem.PPU_addrcnt & 0xFFF;
    if(addrtemp > 0xC00)
    {
        PPU_Mem.name_table[3][addrtemp - 0xC00] = value;        //nametable3
        return;
    }
    if(addrtemp > 0x800)
    {
        PPU_Mem.name_table[2][addrtemp - 0x800] = value;        //nametable2
        return;
    }
    if(addrtemp > 0x400)
    {
        PPU_Mem.name_table[1][addrtemp - 0x400] = value;        //nametable1
        return;
    }
    else
    {
        PPU_Mem.name_table[0][addrtemp] = value;                //nametable0
        return;
    }
}
//-------------------------------------------------------------------------------

//写PPU存储器
void PPU_MemWrite(uint8 value)
{
    switch(PPU_Mem.PPU_addrcnt & 0xF000)
    {
    case 0x0000: //$0000 ~ $0FFF  只读 - 与卡带有关
        break;
    case 0x1000: //$1000 ~ $1FFF  只读 - 与卡带有关
        break;
    case 0x2000: //$2000 ~ $2FFF
        PPU_NameTablesWrite(value);
        break;
    case 0x3000:
        if((PPU_Mem.PPU_addrcnt & 0x1F) > 0x0F)
        {
            PPU_Mem.sprite_palette[(PPU_Mem.PPU_addrcnt & 0xF)] = value; //精灵颜色索引值表
            if((PPU_Mem.PPU_addrcnt & 3) == 0) //对应位置为透明色的景象
            {
                PPU_Mem.sprite_palette[0]  = PPU_Mem.image_palette[0]  = value;
                PPU_Mem.sprite_palette[4]  = PPU_Mem.image_palette[4]  = value;
                PPU_Mem.sprite_palette[8]  = PPU_Mem.image_palette[8]  = value;
                PPU_Mem.sprite_palette[12] = PPU_Mem.image_palette[12] = value;
            }
        }
        else
        {
            PPU_Mem.image_palette[(PPU_Mem.PPU_addrcnt & 0xF)] = value;     //背景颜色索引值表
        }
        break;
    default:
        break;
    }
    //读写后，地址计数器增加，根据$2002 [bit2] 0: +1, 1: +32。
    PPU_Reg.R0 & PPU_ADDRINCR ? PPU_Mem.PPU_addrcnt += 32 : PPU_Mem.PPU_addrcnt++;
}
//-------------------------------------------------------------------------------

